# DPhi Pandas Assignment Details

Dear Learner, 

Congratulations, you have studied Pandas all the way through the end of this bootcamp!!! This is the final graded hands-on exercise where you will be accomplishing the below mentioned task.

# Step 1: Select a Dataset of your choice

*   https://www.kdnuggets.com/datasets/index.html
*   https://dphi.tech/challenges/#past 
* https://pub.towardsai.net/best-datasets-for-machine-learning-data-science-computer-vision-nlp-ai-c9541058cf4f  
* https://medium.com/analytics-vidhya/top-100-open-source-datasets-for-data-science-cd5a8d67cc3d


or you can pick any dataset of your interest on the internet and add reference to it

# Perform Data Cleaning/Preparation & Analysis

my data set URL: http://archive.ics.uci.edu/ml/datasets/Student+Performance

In [1]:
import pandas as pd

data = pd.read_csv("student-mat.csv",delimiter=";")
data

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,...,4,3,4,1,1,3,6,5,6,6
1,GP,F,17,U,GT3,T,1,1,at_home,other,...,5,3,3,1,1,3,4,5,5,6
2,GP,F,15,U,LE3,T,1,1,at_home,other,...,4,3,2,2,3,3,10,7,8,10
3,GP,F,15,U,GT3,T,4,2,health,services,...,3,2,2,1,1,5,2,15,14,15
4,GP,F,16,U,GT3,T,3,3,other,other,...,4,3,2,1,2,5,4,6,10,10
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
390,MS,M,20,U,LE3,A,2,2,services,services,...,5,5,4,4,5,4,11,9,9,9
391,MS,M,17,U,LE3,T,3,1,services,services,...,2,4,5,3,4,2,3,14,16,16
392,MS,M,21,R,GT3,T,1,1,other,other,...,5,5,3,3,3,3,3,10,8,7
393,MS,M,18,R,LE3,T,3,2,services,other,...,4,4,1,3,4,5,0,11,12,10
394,MS,M,19,U,LE3,T,1,1,other,at_home,...,3,2,3,3,3,5,5,8,9,9

In [2]:
data.loc[1:10,['studytime','G1','G2','G3']]

    studytime  G1  G2  G3
1           2   5   5   6
2           2   7   8  10
3           3  15  14  15
4           2   6  10  10
5           2  15  15  15
6           2  12  12  11
7           2   6   5   6
8           2  16  18  19
9           2  14  15  15
10          2  10   8   9

In [3]:
dataAge= data.loc[1:1000,['age','G1','G2','G3']]
dataAge.groupby("age").median()

       G1    G2    G3
age
15   10.5  11.0  11.0
16   11.0  11.5  11.0
17   11.0  11.0  11.0
18   10.0  10.0  10.0
19    9.5   9.0   9.0
20   15.0  14.0  15.0
21   10.0   8.0   7.0
22    6.0   8.0   8.0

In [4]:
data.Fjob.value_counts()

other       217
services    111
teacher      29
at_home      20
health       18
Name: Fjob, dtype: int64

In [5]:
data.isnull().sum()

school        0
sex           0
age           0
address       0
famsize       0
Pstatus       0
Medu          0
Fedu          0
Mjob          0
Fjob          0
reason        0
guardian      0
traveltime    0
studytime     0
failures      0
schoolsup     0
famsup        0
paid          0
activities    0
nursery       0
higher        0
internet      0
romantic      0
famrel        0
freetime      0
goout         0
Dalc          0
Walc          0
health        0
absences      0
G1            0
G2            0
G3            0
dtype: int64

"because no data is missing, I can't provide input if there is missing data. but we can always fill the null data with mean or median value"

In [6]:
data.age.mean()

16.696202531645568

In [7]:
data.G3.median()

11.0

In [8]:
data.absences.sum()

2255

# Step 3: Exploration & Inference

1. Ask at least 3 interesting questions about your dataset
2. Answer the questions by computing the results using Pandas library
3. Add concluding remarks



*   Does a lot of time in studying affect student grades?

In [9]:
sum_grade = data['G1']+data['G2']+data['G3']
data['total grade'] = sum_grade
analy_studytime = data.loc[1:393, ["studytime","total grade"]]
analy_studytime.groupby("studytime").mean()

           total grade
studytime
1            30.807692
2            31.401015
3            34.953846
4            35.185185





*   Is the student's health level affected by the amount of alcohol consumed and whether the health level affects the number of school absences?

In [10]:
sum_alcoholConsumption= data['Dalc']+data['Walc']
data['total alcohol'] = sum_alcoholConsumption
analy_absence = data.loc[1:393, ["health","total alcohol","absences"]]
analy_absence.groupby("health").mean()

        total alcohol  absences
health
1            3.553191  6.319149
2            3.777778  5.955556
3            3.433333  5.855556
4            3.803030  5.045455
5            4.034483  5.648276


\

*   how many students from rural areas(countryside) want to take higher education?

In [11]:
data1=data.loc[1:393, ["address","higher"]]
rural = data1[data1.address == 'R']
analy_rural = rural[rural.higher == 'yes']
analy_rural.count()

address    82
higher     82
dtype: int64

In [19]:
prob_rural =(analy_rural.count()/rural.count())
prob_rural

address    0.931818
higher     0.931818
dtype: float64

# Conclusion


1.   conclusion with the first question is yes, the more students take time to study, they total grade will be higher

2.   conclusion to second question is students with poor level health surprisingly have less total alcohol that the one who higher level health. also the the students with poor level health have likely make more absences

1.   there are 82 students who come from rural areas who want to continue their education to a higher stage, this is 93 percent of all students who come from rural areas